Benchmark/motorBike/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 1;

decomposer      hierarchical;
distributor     ptscotch;

scotchCoeffs
{
    // Optional: tuning parameters for the scotch decomposer
    method          automatic;
}

hierarchicalCoeffs
{
    n               (1 1 1);
    order           xyz;
}


// ************************************************************************* //
